## :x: Apply Result





<pre><code>Error: Error creating service account: googleapi: Error 409: Service account sa-gke-kyma-integration already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.sa_gke_kyma_integration,
  on dns-collector.tf line 3, in resource &#34;google_service_account&#34; &#34;sa_gke_kyma_integration&#34;:
   3: resource &#34;google_service_account&#34; &#34;sa_gke_kyma_integration&#34; {
</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
data.google_client_config.gcp: Reading...
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
data.google_container_cluster.prow_k8s_cluster: Reading...
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
data.google_container_cluster.prow_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=5e665b7758004bfcd801b09dd2fa7c23fcca9d46e860397abc2aac2e213deb16]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
kubernetes_cluster_role.access_signify_secrets_untrusted_workloads: Refreshing state... [id=access-signify-secrets]
kubernetes_service_account.untrusted_workload_terraform_executor: Refreshing state... [id=default/terraform-executor]
kubernetes_cluster_role.access_kyma_bot_github_tokens_untrusted_workloads: Refreshing state... [id=access-kyma-bot-github-tokens]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspprivilegedcontainer\n  annotations:\n    metadata.gatekeeper.sh/title: \"Privileged Container\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls the ability of any container to enable privileged mode.\n      Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n      information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPPrivilegedContainer\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls the ability of any container to enable privileged mode.\n            Corresponds to the `privileged` field in a PodSecurityPolicy. For more\n            information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#privileged\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspprivileged\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_containers[_]\n            not is_exempt(c)\n            c.securityContext.privileged\n            msg := sprintf(\"Privileged container is not allowed: %v, securityContext: %v\", [c.name, c.securityContext])\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspprivilegedcontainer]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspapparmor\n  annotations:\n    metadata.gatekeeper.sh/title: \"App Armor\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Configures an allow-list of AppArmor profiles for use by containers.\n      This corresponds to specific annotations applied to a PodSecurityPolicy.\n      For information on AppArmor, see\n      https://kubernetes.io/docs/tutorials/clusters/apparmor/\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPAppArmor\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Configures an allow-list of AppArmor profiles for use by containers.\n            This corresponds to specific annotations applied to a PodSecurityPolicy.\n            For information on AppArmor, see\n            https://kubernetes.io/docs/tutorials/clusters/apparmor/\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            allowedProfiles:\n              description: \"An array of AppArmor profiles. Examples: `runtime/default`, `unconfined`.\"\n              type: array\n              items:\n                type: string\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspapparmor\n\n        import data.lib.exempt_container.is_exempt\n\n        violation[{\"msg\": msg, \"details\": {}}] {\n            metadata := input.review.object.metadata\n            container := input_containers[_]\n            not is_exempt(container)\n            not input_apparmor_allowed(container, metadata)\n            msg := sprintf(\"AppArmor profile is not allowed, pod: %v, container: %v. Allowed profiles: %v\", [input.review.object.metadata.name, container.name, input.parameters.allowedProfiles])\n        }\n\n        input_apparmor_allowed(container, metadata) {\n            get_annotation_for(container, metadata) == input.parameters.allowedProfiles[_]\n        }\n\n        input_containers[c] {\n            c := input.review.object.spec.containers[_]\n        }\n        input_containers[c] {\n            c := input.review.object.spec.initContainers[_]\n        }\n        input_containers[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n        }\n\n        get_annotation_for(container, metadata) = out {\n            out = metadata.annotations[sprintf(\"container.apparmor.security.beta.kubernetes.io/%v\", [container.name])]\n        }\n        get_annotation_for(container, metadata) = out {\n            not metadata.annotations[sprintf(\"container.apparmor.security.beta.kubernetes.io/%v\", [container.name])]\n            out = \"runtime/default\"\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspapparmor]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["# k8sallowedimages constraint template validates that a pod is not using an image that is not allowed.\n# It prevents the use of images with the :latest tag.\n# The k8sallowedimages accepts one parameter:\n# - images: a list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\napiVersion: templates.gatekeeper.sh/v1beta1\nkind: ConstraintTemplate\nmetadata:\n  name: k8sallowedimages\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sAllowedImages\n      validation:\n        openAPIV3Schema:\n          properties:\n            images:\n              type: array\n              items:\n                type: string\n                description: A list of allowed image URLs. Each image URL must be a prefix of the image URL used in the Pod spec.\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8sallowedimages\n        # Check containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check if object is using an image with latest tag.\n          endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n\n        # Check init containers are not using latest tag.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check if object is using an image with latest tag.\n          endswith(container.image, \":latest\")\n          msg := sprintf(\"container <%v> in namespace <%v> has image <%v> with latest tag, using latest tag is not allowed\", [container.name, input.review.object.metadata.namespace, container.image])\n        }\n        # Check containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.containers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(container.image, input.parameters.images)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }\n\n        # Check init containers are using allowed images.\n        violation[{\"msg\": msg}] {\n          container := input.review.object.spec.initContainers[_]\n          # Check object is using an image that is not allowed.\n          not strings.any_prefix_match(container.image, input.parameters.images)\n          msg := sprintf(\"container <%v> in namespace <%v> has an invalid image repo <%v>, allowed repos are %v\", [container.name, input.review.object.metadata.namespace, container.image, input.parameters.images])\n        }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1beta1/constrainttemplates/k8sallowedimages]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspselinuxv2\n  annotations:\n    metadata.gatekeeper.sh/title: \"SELinux V2\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Defines an allow-list of seLinuxOptions configurations for pod\n      containers. Corresponds to a PodSecurityPolicy requiring SELinux configs.\n      For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#selinux\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPSELinuxV2\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Defines an allow-list of seLinuxOptions configurations for pod\n            containers. Corresponds to a PodSecurityPolicy requiring SELinux configs.\n            For more information, see\n            https://kubernetes.io/docs/concepts/policy/pod-security-policy/#selinux\n          properties:\n            exemptImages:\n              description: >-\n                Any container that uses an image that matches an entry in this list will be excluded\n                from enforcement. Prefix-matching can be signified with `*`. For example: `my-image-*`.\n\n                It is recommended that users use the fully-qualified Docker image name (e.g. start with a domain name)\n                in order to avoid unexpectedly exempting images from an untrusted repository.\n              type: array\n              items:\n                type: string\n            allowedSELinuxOptions:\n              type: array\n              description: \"An allow-list of SELinux options configurations.\"\n              items:\n                type: object\n                description: \"An allowed configuration of SELinux options for a pod container.\"\n                properties:\n                  level:\n                    type: string\n                    description: \"An SELinux level.\"\n                  role:\n                    type: string\n                    description: \"An SELinux role.\"\n                  type:\n                    type: string\n                    description: \"An SELinux type.\"\n                  user:\n                    type: string\n                    description: \"An SELinux user.\"\n  targets:\n    - target: admission.k8s.gatekeeper.sh\n      rego: |\n        package k8spspselinux\n\n        import data.lib.exempt_container.is_exempt\n\n        # Disallow top level custom SELinux options\n        violation[{\"msg\": msg, \"details\": {}}] {\n            has_field(input.review.object.spec.securityContext, \"seLinuxOptions\")\n            not input_seLinuxOptions_allowed(input.review.object.spec.securityContext.seLinuxOptions)\n            msg := sprintf(\"SELinux options is not allowed, pod: %v. Allowed options: %v\", [input.review.object.metadata.name, input.parameters.allowedSELinuxOptions])\n        }\n        # Disallow container level custom SELinux options\n        violation[{\"msg\": msg, \"details\": {}}] {\n            c := input_security_context[_]\n            not is_exempt(c)\n            has_field(c.securityContext, \"seLinuxOptions\")\n            not input_seLinuxOptions_allowed(c.securityContext.seLinuxOptions)\n            msg := sprintf(\"SELinux options is not allowed, pod: %v, container %v. Allowed options: %v\", [input.review.object.metadata.name, c.name, input.parameters.allowedSELinuxOptions])\n        }\n\n        input_seLinuxOptions_allowed(options) {\n            params := input.parameters.allowedSELinuxOptions[_]\n            field_allowed(\"level\", options, params)\n            field_allowed(\"role\", options, params)\n            field_allowed(\"type\", options, params)\n            field_allowed(\"user\", options, params)\n        }\n\n        field_allowed(field, options, params) {\n            params[field] == options[field]\n        }\n        field_allowed(field, options, params) {\n            not has_field(options, field)\n        }\n\n        input_security_context[c] {\n            c := input.review.object.spec.containers[_]\n            has_field(c.securityContext, \"seLinuxOptions\")\n        }\n        input_security_context[c] {\n            c := input.review.object.spec.initContainers[_]\n            has_field(c.securityContext, \"seLinuxOptions\")\n        }\n        input_security_context[c] {\n            c := input.review.object.spec.ephemeralContainers[_]\n            has_field(c.securityContext, \"seLinuxOptions\")\n        }\n\n        # has_field returns whether an object has a field\n        has_field(object, field) = true {\n            object[field]\n        }\n      libs:\n        - |\n          package lib.exempt_container\n\n          is_exempt(container) {\n              exempt_images := object.get(object.get(input, \"parameters\", {}), \"exemptImages\", [])\n              img := container.image\n              exemption := exempt_images[_]\n              _matches_exemption(img, exemption)\n          }\n\n          _matches_exemption(img, exemption) {\n              not endswith(exemption, \"*\")\n              exemption == img\n          }\n\n          _matches_exemption(img, exemption) {\n              endswith(exemption, \"*\")\n              prefix := trim_suffix(exemption, \"*\")\n              startswith(img, prefix)\n          }"]: Refreshing state... [id=/apis/templates.gatekeeper.sh/v1/constrainttemplates/k8spspselinuxv2]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["# https://play.openpolicyagent.org/p/Ha5H9CvMgI\napiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: serviceaccounttrustedusage\n  annotations:\n    metadata.gatekeeper.sh/title: \"ServiceAccount Trusted Usage\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls a k8s workloads ability to use use restricted service accounts.\n      Workloads controlled by this constraint template are: ReplicationController, ReplicaSet, Deployment, StatefulSet, DaemonSet, Job, CronJob, Pod.\nspec:\n  crd:\n    spec:\n      names:\n        kind: ServiceAccountTrustedUsage\n      validation:\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls a k8s workloads ability to use use restricted service accounts.\n          properties:\n            labels:\n              type: array\n              description: >-\n                A list of labels and values the object must specify.\n              items:\n                type: object\n                properties:\n                  key:\n                    type: string\n                    description: >-\n                      The required label.\n                  allowedRegex:\n                    type: string\n                   

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

stimages/e2e-dind-nodejs:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\"\n      - \"gcr.io/k8s-prow/ghproxy:*\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spspseccomps/psp-seccomp]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: ServiceAccountTrustedUsage\nmetadata:\n  name: terraform-executor\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedServiceAccounts:\n      - terraform-executor\n    trustedImages:\n      # postsubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_BASE_SHA apply -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod root module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/configs\\/terraform\\/environments\\/prod plan -input=false -no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod plan -input=false -no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secrets-rotator module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_PULL_SHA apply -- terraform -chdir=\\.\\/development\\/secrets-rotator\\/terraform\\/environments\\/prod apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -pr \\$PULL_NUMBER -sha \\$PULL_PULL_SHA plan -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner plan -input=false -no-color; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # postsubmit prowjob environment prod secret-leak-log-scanner module\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/terraform:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/bin\\/sh\",\"-c\",\"\\/bin\\/terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner init -input=false \\\\u0026\\\\u0026 \\/tfcmt\\/tfcmt -owner \\$REPO_OWNER -repo \\$REPO_NAME -sha \\$PULL_PULL_SHA apply -- terraform -chdir=\\.\\/configs\\/terraform\\/secrets-leaks-log-scanner apply -input=false -no-color -auto-approve; \\/ghcomment\\/github-comment hide --org \\$(REPO_OWNER) --repo \\$(REPO_NAME) -pr \\$(PULL_NUMBER) -sha1 \\$(PULL_PULL_SHA)\"\\],\"container_name\":\"test\",.*}$'\n      # prow decoration\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/clonerefs:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/initupload:*\"\n        command: []\n        args: []\n      - image: \"gcr.io/k8s-prow/entrypoint:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/serviceaccounttrustedusages/terraform-executor]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: kyma-bot-github-sap-token\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedSecrets:\n      - kyma-bot-github-sap-token\n    trustedImages:\n      # Prowjob name: pre-main-check-users-map\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"usersmapchecker\"\\],\"container_name\":\"test\",.*}$'\n      # Prowjob name: github-issues\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/home\\/prow\\/go\\/src\\/github\\.com\\/kyma-project\\/test-infra\\/prow\\/scripts\\/github-issues\\.sh\"\\],\"container_name\":\"test\",.*}$'"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/kyma-bot-github-sap-token]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPSELinuxV2\nmetadata:\n  name: psp-selinux-v2\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  # we're not using any SELinux option in prowjobs"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spspselinuxv2s/psp-selinux-v2]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPPrivilegedContainer\nmetadata:\n  name: psp-privileged-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-nodejs:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\"\n      - \"gcr.io/k8s-prow/ghproxy:*\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spspprivilegedcontainers/psp-privileged-container]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run supporting tools in Prow workload clusters.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-tools-namespaces\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"external-secrets\"\n      - \"gatekeeper-system\"\n  parameters:\n    images:\n      - \"ghcr.io/external-secrets/external-secrets\"\n      - \"openpolicyagent/gatekeeper\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8sallowedimageses/prow-tools-namespaces]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: signify\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedSecrets:\n      - signify-dev-secret\n      - signify-prod-secret\n    trustedImages:\n      # postsubmit prowjob\n      - image: \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/image-builder\",\"--name=.+\",\"--config=\\/config\\/kaniko-build-config\\.yaml\",\"--context=.+\",\"--dockerfile=.+\"\\],\"container_name\":\"test\",.*}$'\n      # postsubmit: main-lifecycle-mgr-build\n      - image: \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"\\/image-builder\",\"--name=.+\",\"--config=\\/config\\/kaniko-build-config\\.yaml\",\"--dockerfile=Dockerfile\"\\],\"container_name\":\"test\",.*}$'\n      # presubmit: pre-serverless-manager-operator-build\n      - image: \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"sh\",\"-c\",\"git config --global --add safe\\.directory \\$\\(pwd\\)\\/module-chart \\\\u0026\\\\u0026 \\.\\/hack\\/generate_module-chart\\.sh \\\\u0026\\\\u0026 \\/image-builder --name=serverless-manager --config=\\/config\\/kaniko-build-config\\.yaml --context=\\. --dockerfile=Dockerfile\"\\],\"container_name\":\"test\",.*}$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/signify]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPHostFilesystem\nmetadata:\n  name: psp-host-filesystem\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    allowedHostPaths:\n      - pathPrefix: \"/lib/modules\"\n      - pathPrefix: \"/sys/fs/cgroup\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spsphostfilesystems/psp-host-filesystem]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPAllowPrivilegeEscalationContainer\nmetadata:\n  name: psp-allow-privilege-escalation-container\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    exemptImages:\n      - gcr.io/k8s-prow/entrypoint:*\n      - gcr.io/k8s-prow/initupload:*\n      - gcr.io/k8s-prow/clonerefs:*\n      - gcr.io/k8s-prow/sidecar:*\n      - \"aquasec/trivy:*\"\n      - \"eu.gcr.io/kyma-project/prow/cleaner:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/bootstrap:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/buildpack-golang:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/gardener-rotate:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/golangci-lint:*\"\n      - \"eu.gcr.io/kyma-project/test-infra/kyma-integration:*\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev/image-builder:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-k3d:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/testimages/e2e-dind-nodejs:*\"\n      - \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n      - \"gcr.io/k8s-prow/generic-autobumper:*\"\n      - \"gcr.io/k8s-prow/ghproxy:*\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spspallowprivilegeescalationcontainers/psp-allow-privilege-escalation-container]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["apiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sPSPHostNamespace\nmetadata:\n  name: psp-host-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8spsphostnamespaces/psp-host-namespace]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Allow only images needed to run prowjobs.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-prowjobs-namespace\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"docker.io/aquasec/trivy\"\n      - \"docker.io/zricethezav/gitleaks\"\n      - \"docker.io/maven\"\n      - \"gcr.io/k8s-prow/checkconfig\"\n      - \"gcr.io/k8s-prow/generic-autobumper\"\n      - \"gcr.io/k8s-prow/label_sync\"\n      - \"gcr.io/k8s-prow/branchprotector\"\n      - \"gcr.io/k8s-prow/commenter\"\n      - \"gcr.io/k8s-prow/gencred\"\n      - \"gcr.io/k8s-prow/ghproxy\"\n      - \"gcr.io/k8s-prow/sidecar\" # prowjob decoration\n      - \"gcr.io/k8s-prow/clonerefs\" # prowjob decoration\n      - \"gcr.io/k8s-prow/initupload\" # prowjob decoration\n      - \"gcr.io/k8s-prow/entrypoint\" # prowjob decoration\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\""]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/k8sallowedimageses/prow-prowjobs-namespace]
module.trusted_workload_gatekeeper.kubectl_manifest.constraints["# Constraint to allow only image-builder tool trusted usage on tekton cluster run as image-builder service account identity.\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: SecretTrustedUsage\nmetadata:\n  name: pjtester-kubeconfig\nspec:\n  enforcementAction: warn\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n  parameters:\n    restrictedSecrets:\n      - pjtester-kubeconfig\n      - pjtester-github-oauth-token\n    trustedImages:\n      # postsubmit prowjob\n      - image: \"europe-docker.pkg.dev/kyma-project/prod/test-infra/prow-tools:*\"\n        command:\n          - /tools/entrypoint\n        args: []\n        entrypoint_options: '^{.*\"args\":\\[\"pjtester\",\"--github-token-path=\\/etc\\/github\\/oauth\"\\],\"container_name\":\"test\",.*}$'\n      # sidecar\n      - image: \"gcr.io/k8s-prow/sidecar:*\"\n        command: []\n        args: []"]: Refreshing state... [id=/apis/constraints.gatekeeper.sh/v1beta1/secrettrustedusages/pjtester-kubeconfig]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_binding.dns_collector_bucket_get will be created
  + resource "google_project_iam_binding" "dns_collector_bucket_get" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "projects/sap-kyma-prow/roles/BucketGet"
    }

  # google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer will be created
  + resource "google_project_iam_binding" "dns_collector_container_analysis_occurrences_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/containeranalysis.occurrences.viewer"
    }

  # google_project_iam_binding.dns_collector_dns_reader will be created
  + resource "google_project_iam_binding" "dns_collector_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/dns.reader"
    }

  # google_service_account.sa_gke_kyma_integration will be created
  + resource "google_service_account" "sa_gke_kyma_integration" {
      + account_id   = "sa-gke-kyma-integration"
      + description  = "Service account is used by Prow to integrate with GKE."
      + disabled     = false
      + display_name = "sa-gke-kyma-integration"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
google_service_account.sa_gke_kyma_integration: Creating...

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

Error: Error creating service account: googleapi: Error 409: Service account sa-gke-kyma-integration already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.sa_gke_kyma_integration,
  on dns-collector.tf line 3, in resource "google_service_account" "sa_gke_kyma_integration":
   3: resource "google_service_account" "sa_gke_kyma_integration" {


```

</details>

`

<!-- github-comment: {"Command":"apply","PRNumber":8249,"Program":"tfcmt","SHA1":"a0d4a88a09f7a74fef0431abc92949b6cebcfbb0","Vars":{}} -->